export const citys = [{
    'lnglat': [120.171465, 30.250236],
    'name': '上城区',
    'style': 2
}, {
    'lnglat': [120.172763, 30.276271],
    'name': '下城区',
    'style': 2
}, {
    'lnglat': [120.202633, 30.266603],
    'name': '江干区',
    'style': 2
}, {
    'lnglat': [120.150053, 30.314697],
    'name': '拱墅区',
    'style': 2
}, {
    'lnglat': [120.147376, 30.272934],
    'name': '西湖区',
    'style': 2
}, {
    'lnglat': [120.21062, 30.206615],
    'name': '滨江区',
    'style': 2
}, {
    'lnglat': [120.27069, 30.162932],
    'name': '萧山区',
    'style': 2
}, {
    'lnglat': [120.301737, 30.421187],
    'name': '余杭区',
    'style': 2
}, {
    'lnglat': [119.949869, 30.049871],
    'name': '富阳区',
    'style': 2
}, {
    'lnglat': [119.685045, 29.797437],
    'name': '桐庐县',
    'style': 2
}, {
    'lnglat': [119.044276, 29.604177],
    'name': '淳安县',
    'style': 2
}, {
    'lnglat': [119.279089, 29.472284],
    'name': '建德市',
    'style': 2
}, {
    'lnglat': [119.715101, 30.231153],
    'name': '临安市',
    'style': 2
}, {
    'lnglat': [121.539698, 29.874452],
    'name': '海曙区',
    'style': 2
}, {
    'lnglat': [121.559282, 29.888361],
    'name': '江北区',
    'style': 2
}, {
    'lnglat': [121.831303, 29.90944],
    'name': '北仑区',
    'style': 2
}, {
    'lnglat': [121.713162, 29.952107],
    'name': '镇海区',
    'style': 2
}, {
    'lnglat': [121.558436, 29.831662],
    'name': '鄞州区',
    'style': 2
}, {
    'lnglat': [121.877091, 29.470206],
    'name': '象山县',
    'style': 2
}, {
    'lnglat': [121.432606, 29.299836],
    'name': '宁海县',
    'style': 2
}, {
    'lnglat': [121.156294, 30.045404],
    'name': '余姚市',
    'style': 2
}, {
    'lnglat': [121.248052, 30.177142],
    'name': '慈溪市',
    'style': 2
}, {
    'lnglat': [121.41089, 29.662348],
    'name': '奉化区',
    'style': 2
}]